--2014/09/01
--五十音の数字暗号を解読します
--例えば11->'い'，4444->'て'となる．丁度ガラケーと同じ．
--単語を空白区切り(例：6 333 2222 999)で入力してください．
--濁点半濁点には未対応．
import Data.Char
import Control.Applicative

main = do
  wds <- words <$> getLine
  let a = ['あ','い','う','え','お','か','き','く','け','こ','さ','し','す','せ','そ','た','ち','つ','て','と','な','に','ぬ','ね','の','は','ひ','ふ','へ','ほ','ま','み','む','め','も','や','ゐ','ゆ','ゑ','よ','ら','り','る','れ','ろ','わ','を','ん']
  --let a = ['あ','い'..] --文字コード的に連続とは限らないのでボツ
  putStrLn (map ((a !!).figcode) wds) --通し番号から対応する文字に変換

--figcode::その数列に対するユニークな通し番号を求める
figcode::String -> Int
figcode as@('0':xs) = 44 + length as --わ行
figcode as@(x:xs) = length as + 5*(read [x]::Int) - 6 --あ~ら行
